[InteractiveObjects.IO_MO_HellHath_Explosive InteractiveObjectDefinition]
StatusMenuMapInfoBoxHeader=""
StatusMenuMapInfoBoxDescription=""

[ItemDefs.ID_ForemanExplosives MissionItemDefinition]
UseFailureCharacterMessage="you should %s Use this article.."
ItemName="CEO of Dynamite"
PickupMessage="You did it %s"
UseFailureLevelMessage="You must be at least %d level to use this feature."
UseFailureConstraintsMessage="This product is missing."
NoManufacturerName="usually"

[ItemDefs.ID_ForemanExplosives:AttributePresentationDefinition_2 AttributePresentationDefinition]
Description="This explosion can be used to destroy retaining walls.."
NoConstraintText=""
Suffix=""
Prefix=""

[ItemDefs.ID_ForemansKey MissionItemDefinition]
UseFailureCharacterMessage="you must be... %s Use this item."
ItemName="the key"
PickupMessage="It's up to you %s"
UseFailureLevelMessage="To use this item you must have at least %d level.."
UseFailureConstraintsMessage="You can't use it."
NoManufacturerName="Usually"

[ItemDefs.ID_ForemansKey:AttributePresentationDefinition_1 AttributePresentationDefinition]
Description="Boiler main switch."
NoConstraintText=""
Suffix=""
Prefix=""

